mcp-parallel/findings/full-vm-peak-2026-08-14/wrk_health.txt
=== wrk HTTP ceiling 2026-08-14T13:00:24Z ===
host=ip-172-31-9-177.ap-south-1.compute.internal ulimit_n=65535
gateway_ip=172.18.0.6
wrk=wrk 4.2.0 [epoll] Copyright (C) 2012 Will Glozer

=== health probes ===
container http://172.18.0.6:8300/health status=200 t=0.001737
localhost http://127.0.0.1:8300/health status=200 t=0.001229

=== wrk -t8 -c400 -d15s --latency http://172.18.0.6:8300/health ===
Running 15s test @ http://172.18.0.6:8300/health
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    65.24ms   60.74ms 539.87ms   90.07%
    Req/Sec     0.91k   278.17     7.75k    89.84%
  Latency Distribution
     50%   50.10ms
     75%   75.17ms
     90%  121.21ms
     99%  329.12ms
  109211 requests in 15.08s, 53.33MB read
Requests/sec:   7242.47
Transfer/sec:      3.54MB

=== wrk -t8 -c2000 -d15s --latency http://172.18.0.6:8300/health ===
Running 15s test @ http://172.18.0.6:8300/health
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   363.98ms  208.17ms   1.38s    67.54%
    Req/Sec   699.41    175.92     1.31k    70.27%
  Latency Distribution
     50%  313.37ms
     75%  470.81ms
     90%  676.29ms
     99%    1.04s 
  82465 requests in 15.09s, 40.29MB read
Requests/sec:   5465.04
Transfer/sec:      2.67MB

=== wrk -t8 -c400 -d15s --latency http://127.0.0.1:8300/health ===
Running 15s test @ http://127.0.0.1:8300/health
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    83.63ms   97.30ms 849.39ms   89.25%
    Req/Sec   811.21    248.44     1.81k    68.45%
  Latency Distribution
     50%   62.66ms
     75%  105.58ms
     90%  188.74ms
     99%  474.96ms
  96505 requests in 15.05s, 47.13MB read
Requests/sec:   6411.27
Transfer/sec:      3.13MB

=== wrk -t8 -c2000 -d15s --latency http://127.0.0.1:8300/health ===
Running 15s test @ http://127.0.0.1:8300/health
  8 threads and 2000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   395.38ms  237.14ms   1.61s    67.45%
    Req/Sec   647.14    156.12     1.24k    70.55%
  Latency Distribution
     50%  349.77ms
     75%  515.80ms
     90%  738.50ms
     99%    1.13s 
  76829 requests in 15.04s, 37.55MB read
Requests/sec:   5109.79
Transfer/sec:      2.50MB

=== docker stats samples during wrk ===
2026-08-14T13:00:24Z
ai_mesh_firewall-gateway-1 cpu=707.94% mem=3.266GiB / 12GiB
2026-08-14T13:00:26Z
ai_mesh_firewall-gateway-1 cpu=707.14% mem=3.298GiB / 12GiB
2026-08-14T13:00:29Z
ai_mesh_firewall-gateway-1 cpu=739.01% mem=3.301GiB / 12GiB
2026-08-14T13:00:31Z
ai_mesh_firewall-gateway-1 cpu=750.64% mem=3.302GiB / 12GiB
2026-08-14T13:00:34Z
ai_mesh_firewall-gateway-1 cpu=738.10% mem=3.303GiB / 12GiB
2026-08-14T13:00:36Z
ai_mesh_firewall-gateway-1 cpu=665.01% mem=3.303GiB / 12GiB
2026-08-14T13:00:39Z
ai_mesh_firewall-gateway-1 cpu=531.32% mem=3.364GiB / 12GiB
2026-08-14T13:00:41Z
ai_mesh_firewall-gateway-1 cpu=758.27% mem=3.425GiB / 12GiB
2026-08-14T13:00:44Z
ai_mesh_firewall-gateway-1 cpu=753.30% mem=3.427GiB / 12GiB
2026-08-14T13:00:46Z
ai_mesh_firewall-gateway-1 cpu=687.89% mem=3.429GiB / 12GiB
2026-08-14T13:00:49Z
ai_mesh_firewall-gateway-1 cpu=757.52% mem=3.429GiB / 12GiB
2026-08-14T13:00:52Z
ai_mesh_firewall-gateway-1 cpu=749.95% mem=3.43GiB / 12GiB
2026-08-14T13:00:54Z
ai_mesh_firewall-gateway-1 cpu=706.01% mem=3.424GiB / 12GiB
2026-08-14T13:00:57Z
ai_mesh_firewall-gateway-1 cpu=670.98% mem=3.424GiB / 12GiB
2026-08-14T13:00:59Z
ai_mesh_firewall-gateway-1 cpu=683.72% mem=3.424GiB / 12GiB
2026-08-14T13:01:02Z
ai_mesh_firewall-gateway-1 cpu=691.52% mem=3.424GiB / 12GiB
2026-08-14T13:01:04Z
ai_mesh_firewall-gateway-1 cpu=683.86% mem=3.423GiB / 12GiB
2026-08-14T13:01:07Z
ai_mesh_firewall-gateway-1 cpu=657.33% mem=3.423GiB / 12GiB
2026-08-14T13:01:09Z
ai_mesh_firewall-gateway-1 cpu=472.95% mem=3.43GiB / 12GiB
2026-08-14T13:01:12Z
ai_mesh_firewall-gateway-1 cpu=721.07% mem=3.44GiB / 12GiB
2026-08-14T13:01:14Z
ai_mesh_firewall-gateway-1 cpu=717.04% mem=3.441GiB / 12GiB
2026-08-14T13:01:17Z
ai_mesh_firewall-gateway-1 cpu=704.98% mem=3.442GiB / 12GiB
2026-08-14T13:01:19Z
ai_mesh_firewall-gateway-1 cpu=714.62% mem=3.452GiB / 12GiB
2026-08-14T13:01:22Z
ai_mesh_firewall-gateway-1 cpu=703.13% mem=3.443GiB / 12GiB
2026-08-14T13:01:24Z

=== done 2026-08-14T13:01:25Z ===